In [2]:
import pandas as pd
df = pd.read_csv('Csvtest.csv', encoding='euc-kr')
df.head()

    이름  학번  국어  수학  영어  합계  평균  석차
0  홍길동   1  90  85  60 NaN NaN NaN
1  강감찬   2  85  75  65 NaN NaN NaN
2  나원참   3  78  83  95 NaN NaN NaN
3  이순신   4  90  95  90 NaN NaN NaN
4  나홀로   5  88  72  70 NaN NaN NaN

In [4]:
a = df["국어"]
b = df["수학"]
c = df["영어"]

print(a)
print(b)
print(c)

0    90
1    85
2    78
3    90
4    88
5    88
6    69
7    79
8    88
9    88
Name: 국어, dtype: int64
0    85
1    75
2    83
3    95
4    72
5    92
6    78
7    96
8    56
9    96
Name: 수학, dtype: int64
0    60
1    65
2    95
3    90
4    70
5    99
6    77
7    90
8    45
9    66
Name: 영어, dtype: int64

In [10]:
sum=lambda x,y,z: x+y+z;
print("정수의 합 : \n",sum(a,b,c))

정수의 합 :
 0    235
1    225
2    256
3    275
4    230
5    279
6    224
7    265
8    189
9    250
dtype: int64